<script setup lang="ts"></script>

<template>
  <section class="bl_container">
    <h2>職務経歴</h2>
    <section class="bl_card">
      <h3>株式会社大知／東京都品川区</h3>
      <p>期間：2007年4月～2009年3月</p>
      <h4>概要</h4>
      <ul>
        <li>教科書や教育関連の書籍のDTPやイラスト制作</li>
        <li>また、WEBサイトの更新作業も</li>
      </ul>
    </section>

    <section class="bl_card">
      <h3>フリーター</h3>
      <p>期間：2009年4月～2011年1月</p>
      <h4>概要</h4>
      <ul>
        <li>飲食店のアルバイト・染料工場の派遣社員など</li>
        <li>アルバイトでの人脈により、飲食店のWEBサイト・名刺デザイン・POPやメニューなどの制作</li>
      </ul>
    </section>

    <section class="bl_card">
      <h3>株式会社ヘレナメディアリサーチ／茨城県土浦市</h3>
      <p>期間：2011年2月～2014年5月</p>
      <h4>映像制作部概要</h4>
      <p>期間：はじめの3年間</p>
      <ul>
        <li>官庁・地方自治体・企業などのプロモーションビデオなど制作</li>
        <li>幼稚園などの発表会ビデオの制作・販売</li>
      </ul>
      <h4>映像制作の主な実績</h4>
      <ul>
        <li>つくばモビリティロボット実験特区PV／つくば市役所産業政策課</li>
        <li>社員研修用ビデオ／筑波銀行</li>
        <li>HAL福祉用PV・使用講習ビデオなど／サイバーダイン（株）</li>
        <li>学術情報メディアセンターPV／筑波大学</li>
        <li>（一社）いばらき出会いサポートセンターPVおよび利用案内ビデオ</li>
        <li>戦争体験者インタービュー映像記録／予科練平和記念館</li>
        <li>衆議院議員選挙投票促進CM／茨城県市町村課</li>
      </ul>
      <h4>営業企画部概要</h4>
      <p>期間：3年目より異動・約1年半ほど</p>
      <ul>
        <li>WEB・印刷物・映像制作についての営業・企画</li>
      </ul>
      <h4>営業企画の主な実績</h4>
      <ul>
        <li>偕楽園ウェブサイト／茨城県庁土木部</li>
        <li>一般財団法人茨城県メディカルセンターウェブサイト</li>
        <li>市役所ウェブサイト</li>
        <li>社会福祉協議会ウェブサイト</li>
      </ul>
    </section>

    <section class="bl_card">
      <h3>株式会社クリエイト日報／東京都千代田区</h3>
      <p>期間：2014年9月～現在</p>
      <h4>概要</h4>
      <ul>
        <li>包装業界・環境業界の出版社である自社サイトの保守管理</li>
        <li>自社主催の展示会サイトの保守管理</li>
        <li>業務委託での制作や保守管理</li>
      </ul>
      <h4>実績</h4>
      <ul>
        <li>日報インターネット／日報ビジネス</li>
        <li>NEW環境展ウェブサイト／日報ビジネス</li>
        <li>フェリス女学院大学や附属図書館などの関連ウェブサイト</li>
        <li>スコットプランニングウェブサイト</li>
      </ul>
    </section>
  </section>
</template>
